oss/pipewarden/rules/monitor/src/main/resources/requestXMLs/nsl/GetAvailableTelephoneNumbers.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns5:GetAvailableTelephoneNumbersRequest xmlns:ns5="http://ipl.netcom.no/service/telephoneregistry/v1_3" xmlns:ns10="http://ipl.netcom.no/service/order/v1_2" xmlns:ns12="http://ipl.netcom.no/service/dealer/v1_2" xmlns:ns13="http://ipl.netcom.no/service/equipment/v1_2" xmlns:ns14="http://ipl.netcom.no/common/version3.0" xmlns:ns2="http://ipl.netcom.no/version2.0/annotation" xmlns:ns3="http://ipl.netcom.no/service/telephoneregistry/v1_2" xmlns:ns4="http://ipl.netcom.no/service/common/v1_2" xmlns:ns6="http://ipl.netcom.no/service/common/v1_3" xmlns:ns7="http://ipl.netcom.no/service/subscription/v1_3" xmlns:ns8="http://ipl.netcom.no/service/account/v1_2" xmlns:ns9="http://ipl.netcom.no/service/agreement/v1_2" xmlns="">
            <ns2:AnnotationRoot>
                <ns2:clienttraceid>0cc4a587-3675-452a-817b-80283cb08e6d</ns2:clienttraceid>
                <ns2:servertraceid>IPL.ResourceManager.2018-06-20 10:13:19:452</ns2:servertraceid>
                <ns2:callsequencetrace>tango.ResourceManager#getAvailableTelephoneNumbers</ns2:callsequencetrace>
                <ns2:cleartrusttoken/>
                <ns2:endusername>0cc4a587-3675-452a-817b-80283cb08e6d</ns2:endusername>
                <ns2:languagecode/>
            </ns2:AnnotationRoot>
            <ns5:ClientTimeout>60</ns5:ClientTimeout>
            <ns5:ChannelType>INT_STORE</ns5:ChannelType>
            <ns5:DealerCode>1018</ns5:DealerCode>
            <ns5:TelephoneNumberFilter>
                <ns6:localNumberPattern/>
                <ns6:maxQuantity>0</ns6:maxQuantity>
                <ns6:TelephoneNumberSpecification>
                    <ns6:Brand>TELIADK</ns6:Brand>
                    <ns6:TelephoneNumberCategory>MOBILE</ns6:TelephoneNumberCategory>
                    <ns6:TelephoneNumberClass>REGULAR</ns6:TelephoneNumberClass>
                </ns6:TelephoneNumberSpecification>
            </ns5:TelephoneNumberFilter>
        </ns5:GetAvailableTelephoneNumbersRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>